MusicApp/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."band_id" = $1 LIMIT $2  [["band_id", "1"], ["LIMIT", 1]]
---
  def new
    @band = Band.find_by(id: params[:band_id])

SELECT  "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "Tycho"], ["LIMIT", 1]]
INSERT INTO "albums" ("title", "yr", "band_id", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sdjf"], ["yr", 1995], ["band_id", 4], ["studio", false], ["created_at", "2019-02-01 01:20:11.084201"], ["updated_at", "2019-02-01 01:20:11.084201"]]
---
  def create
    #find exsiting record of band with band params from form
    @band = Band.find_by_name(album_params[:band_name])

    #get id of band from database
    @band_id = @band.band_id

    #create new instance album with params from form
    #add in band id

    @album = Album.new(title: album_params[:album_name],
                      yr: album_params[:album_yr],
                      band_id: @band_id,
                      studio: album_params[:studio])

    #save album to database
    @album.save