MusicApp/app/models/band.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "Tera Melos"], ["LIMIT", 1]]
---
  def self.find_by_name(name)
    @band = Band.find_by(name: name)